Revit 2027 API
NumberingFormatSettings.GetParameter Method
 Get the parameter at the provided index incorporated into the numeric label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingFormattedParameter GetParameter(
	int index
)
Public Function GetParameter (
	index As Integer
) As NumberingFormattedParameter
public:
NumberingFormattedParameter^ GetParameter(
	int index
)
member GetParameter :
        index : int -> NumberingFormattedParameter
Parameters
index Int32
Return Value
NumberingFormattedParameter
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index must be in range between 0 and NumberOfParameters.
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace